In [1]:
import os
import pandas as pd
from IPython.display import display
from collections import Counter
from scipy.stats import chi2_contingency

In [2]:
path_to_data = "./data/"

In [3]:
def path_join(filename: str, path_to_folder: str = path_to_data) -> str:
    """
    os.path.join with default path_to_data.
    
    :param str filename: filename.
    :param str path_to_folder: path to the folder where the filename is located.
    :return: joined path.
    :rtype: str
    """
    
    return os.path.join(path_to_folder, filename)

### columns description

In [4]:
df_desc = pd.read_csv(path_join('HomeCredit_columns_description.csv'), encoding='cp1251', index_col=0)

In [5]:
df_desc[df_desc.Table == 'application_{train|test}.csv'].head()

,Table,Row,Description,Special
1,application_{train|test}.csv,SK_ID_CURR,ID of loan in our sample,NaN
2,application_{train|test}.csv,TARGET,Target variable (1 - client with payment diffi...,NaN
5,application_{train|test}.csv,NAME_CONTRACT_TYPE,Identification if loan is cash or revolving,NaN
6,application_{train|test}.csv,CODE_GENDER,Gender of the client,NaN
7,application_{train|test}.csv,FLAG_OWN_CAR,Flag if the client owns a car,NaN

### load train

In [6]:
df_application_train = pd.read_csv(path_join('application_train.csv'))

In [7]:
df_application_train.head()

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
0,100002,1,Cash loans,M,N,Y,0,202500.0,406597.5,24700.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0
1,100003,0,Cash loans,F,N,N,0,270000.0,1293502.5,35698.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,135000.0,6750.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
3,100006,0,Cash loans,F,N,Y,0,135000.0,312682.5,29686.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,100007,0,Cash loans,M,N,Y,0,121500.0,513000.0,21865.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0

In [8]:
df_application_train.tail()

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
307506,456251,0,Cash loans,M,N,N,0,157500.0,254700.0,27558.0,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
307507,456252,0,Cash loans,F,N,Y,0,72000.0,269550.0,12001.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
307508,456253,0,Cash loans,F,N,Y,0,153000.0,677664.0,29979.0,...,0,0,0,0,1.0,0.0,0.0,1.0,0.0,1.0
307509,456254,1,Cash loans,F,N,Y,0,171000.0,370107.0,20205.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
307510,456255,0,Cash loans,F,N,N,0,157500.0,675000.0,49117.5,...,0,0,0,0,0.0,0.0,0.0,2.0,0.0,1.0

In [9]:
df_application_train.shape

(307511, 122)

In [10]:
# get columns discription for each column in train
for column in df_application_train.columns:
    column_description = df_desc[df_desc.Row == column].Description.values
    
    print(f"{column}: {column_description}")
    print(116*'=')

SK_ID_CURR: ['ID of loan in our sample'
 'ID of loan in our sample - one loan in our sample can have 0,1,2 or more related previous credits in credit bureau '
 'ID of loan in our sample' 'ID of loan in our sample'
 'ID of loan in our sample' 'ID of loan in our sample']
====================================================================================================================
TARGET: ['Target variable (1 - client with payment difficulties: he/she had late payment more than X days on at least one of the first Y installments of the loan in our sample, 0 - all other cases)']
====================================================================================================================
NAME_CONTRACT_TYPE: ['Identification if loan is cash or revolving'
 'Contract product type (Cash loan, consumer loan [POS] ,...) of the previous application']
====================================================================================================================
CODE_GENDER: ['Gender of the client']
====================================================================================================================
FLAG_OWN_CAR: ['Flag if the client owns a car']
====================================================================================================================
FLAG_OWN_REALTY: ['Flag if client owns a house or flat']
====================================================================================================================
CNT_CHILDREN: ['Number of children the client has']
====================================================================================================================
AMT_INCOME_TOTAL: ['Income of the client']
====================================================================================================================
AMT_CREDIT: ['Credit amount of the loan'
 'Final credit amount on the previous application. This differs from AMT_APPLICATION in a way that the AMT_APPLICATION is the amount for which the client initially applied for, but during our approval process he could have received different amount - AMT_CREDIT']
====================================================================================================================
AMT_ANNUITY: ['Loan annuity' 'Annuity of the Credit Bureau credit'
 'Annuity of previous application']
====================================================================================================================
AMT_GOODS_PRICE: ['For consumer loans it is the price of the goods for which the loan is given'
 'Goods price of good that client asked for (if applicable) on the previous application']
====================================================================================================================
NAME_TYPE_SUITE: ['Who was accompanying client when he was applying for the loan'
 'Who accompanied client when applying for the previous application']
====================================================================================================================
NAME_INCOME_TYPE: ['Clients income type (businessman, working, maternity leave,…)']
====================================================================================================================
NAME_EDUCATION_TYPE: ['Level of highest education the client achieved']
====================================================================================================================
NAME_FAMILY_STATUS: ['Family status of the client']
====================================================================================================================
NAME_HOUSING_TYPE: ['What is the housing situation of the client (renting, living with parents, ...)']
====================================================================================================================
REGION_POPULATION_RELATIVE: ['Normalized population of region where client lives (higher number means the client lives in more populated region)']
====================================================================================================================
DAYS_BIRTH: ["Client's age in days at the time of application"]
====================================================================================================================
DAYS_EMPLOYED: ['How many days before the application the person started current employment']
====================================================================================================================
DAYS_REGISTRATION: ['How many days before the application did client change his registration']
====================================================================================================================
DAYS_ID_PUBLISH: ['How many days before the application did client change the identity document with which he applied for the loan']
====================================================================================================================
OWN_CAR_AGE: ["Age of client's car"]
====================================================================================================================
FLAG_MOBIL: ['Did client provide mobile phone (1=YES, 0=NO)']
====================================================================================================================
FLAG_EMP_PHONE: ['Did client provide work phone (1=YES, 0=NO)']
====================================================================================================================
FLAG_WORK_PHONE: ['Did client provide home phone (1=YES, 0=NO)']
====================================================================================================================
FLAG_CONT_MOBILE: ['Was mobile phone reachable (1=YES, 0=NO)']
====================================================================================================================
FLAG_PHONE: ['Did client provide home phone (1=YES, 0=NO)']
====================================================================================================================
FLAG_EMAIL: ['Did client provide email (1=YES, 0=NO)']
====================================================================================================================
OCCUPATION_TYPE: ['What kind of occupation does the client have']
====================================================================================================================
CNT_FAM_MEMBERS: ['How many family members does client have']
====================================================================================================================
REGION_RATING_CLIENT: ['Our rating of the region where client lives (1,2,3)']
====================================================================================================================
REGION_RATING_CLIENT_W_CITY: ['Our rating of the region where client lives with taking city into account (1,2,3)']
====================================================================================================================
WEEKDAY_APPR_PROCESS_START: ['On which day of the week did the client apply for the loan'
 'On which day of the week did the client apply for previous application']
====================================================================================================================
HOUR_APPR_PROCESS_START: ['Approximately at what hour did the client apply for the loan'
 'Approximately at what day hour did the client apply for the previous application']
====================================================================================================================
REG_REGION_NOT_LIVE_REGION: ["Flag if client's permanent address does not match contact address (1=different, 0=same, at region level)"]
====================================================================================================================
REG_REGION_NOT_WORK_REGION: ["Flag if client's permanent address does not match work address (1=different, 0=same, at region level)"]
====================================================================================================================
LIVE_REGION_NOT_WORK_REGION: ["Flag if client's contact address does not match work address (1=different, 0=same, at region level)"]
====================================================================================================================
REG_CITY_NOT_LIVE_CITY: ["Flag if client's permanent address does not match contact address (1=different, 0=same, at city level)"]
====================================================================================================================
REG_CITY_NOT_WORK_CITY: ["Flag if client's permanent address does not match work address (1=different, 0=same, at city level)"]
====================================================================================================================
LIVE_CITY_NOT_WORK_CITY: ["Flag if client's contact address does not match work address (1=different, 0=same, at city level)"]
====================================================================================================================
ORGANIZATION_TYPE: ['Type of organization where client works']
====================================================================================================================
EXT_SOURCE_1: ['Normalized score from external data source']
====================================================================================================================
EXT_SOURCE_2: ['Normalized score from external data source']
====================================================================================================================
EXT_SOURCE_3: ['Normalized score from external data source']
====================================================================================================================
APARTMENTS_AVG: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
BASEMENTAREA_AVG: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
YEARS_BEGINEXPLUATATION_AVG: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
YEARS_BUILD_AVG: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
COMMONAREA_AVG: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
ELEVATORS_AVG: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
ENTRANCES_AVG: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
FLOORSMAX_AVG: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
FLOORSMIN_AVG: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
LANDAREA_AVG: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
LIVINGAPARTMENTS_AVG: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
LIVINGAREA_AVG: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
NONLIVINGAPARTMENTS_AVG: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
NONLIVINGAREA_AVG: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
APARTMENTS_MODE: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
BASEMENTAREA_MODE: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
YEARS_BEGINEXPLUATATION_MODE: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
YEARS_BUILD_MODE: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
COMMONAREA_MODE: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
ELEVATORS_MODE: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
ENTRANCES_MODE: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
FLOORSMAX_MODE: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
FLOORSMIN_MODE: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
LANDAREA_MODE: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']
====================================================================================================================
LIVINGAPARTMENTS_MODE: ['Normalized information about building where the client lives, What is average (_AVG suffix), modus (_MODE suffix), median (_MEDI suffix) apartment size, common area, living area, age of building, number of elevators, number of entrances, state of the building, number of floor']

In [11]:
# get nunique for each column in train
for column in df_application_train.columns:
    column_nunique = df_application_train[column].nunique()
    column_5_unique = df_application_train[column].unique()[:5]
    
    print(f"{column}: {column_nunique}")
    print(f"{column}: {column_5_unique}")
    print(116*'=')

SK_ID_CURR: 307511
SK_ID_CURR: [100002 100003 100004 100006 100007]
====================================================================================================================
TARGET: 2
TARGET: [1 0]
====================================================================================================================
NAME_CONTRACT_TYPE: 2
NAME_CONTRACT_TYPE: ['Cash loans' 'Revolving loans']
====================================================================================================================
CODE_GENDER: 3
CODE_GENDER: ['M' 'F' 'XNA']
====================================================================================================================
FLAG_OWN_CAR: 2
FLAG_OWN_CAR: ['N' 'Y']
====================================================================================================================
FLAG_OWN_REALTY: 2
FLAG_OWN_REALTY: ['Y' 'N']
====================================================================================================================
CNT_CHILDREN: 15
CNT_CHILDREN: [0 1 2 3 4]
====================================================================================================================
AMT_INCOME_TOTAL: 2548
AMT_INCOME_TOTAL: [202500. 270000.  67500. 135000. 121500.]
====================================================================================================================
AMT_CREDIT: 5603
AMT_CREDIT: [ 406597.5 1293502.5  135000.   312682.5  513000. ]
====================================================================================================================
AMT_ANNUITY: 13672
AMT_ANNUITY: [24700.5 35698.5  6750.  29686.5 21865.5]
====================================================================================================================
AMT_GOODS_PRICE: 1002
AMT_GOODS_PRICE: [ 351000. 1129500.  135000.  297000.  513000.]
====================================================================================================================
NAME_TYPE_SUITE: 7
NAME_TYPE_SUITE: ['Unaccompanied' 'Family' 'Spouse, partner' 'Children' 'Other_A']
====================================================================================================================
NAME_INCOME_TYPE: 8
NAME_INCOME_TYPE: ['Working' 'State servant' 'Commercial associate' 'Pensioner' 'Unemployed']
====================================================================================================================
NAME_EDUCATION_TYPE: 5
NAME_EDUCATION_TYPE: ['Secondary / secondary special' 'Higher education' 'Incomplete higher'
 'Lower secondary' 'Academic degree']
====================================================================================================================
NAME_FAMILY_STATUS: 6
NAME_FAMILY_STATUS: ['Single / not married' 'Married' 'Civil marriage' 'Widow' 'Separated']
====================================================================================================================
NAME_HOUSING_TYPE: 6
NAME_HOUSING_TYPE: ['House / apartment' 'Rented apartment' 'With parents'
 'Municipal apartment' 'Office apartment']
====================================================================================================================
REGION_POPULATION_RELATIVE: 81
REGION_POPULATION_RELATIVE: [0.018801 0.003541 0.010032 0.008019 0.028663]
====================================================================================================================
DAYS_BIRTH: 17460
DAYS_BIRTH: [ -9461 -16765 -19046 -19005 -19932]
====================================================================================================================
DAYS_EMPLOYED: 12574
DAYS_EMPLOYED: [ -637 -1188  -225 -3039 -3038]
====================================================================================================================
DAYS_REGISTRATION: 15688
DAYS_REGISTRATION: [-3648. -1186. -4260. -9833. -4311.]
====================================================================================================================
DAYS_ID_PUBLISH: 6168
DAYS_ID_PUBLISH: [-2120  -291 -2531 -2437 -3458]
====================================================================================================================
OWN_CAR_AGE: 62
OWN_CAR_AGE: [nan 26. 17.  8. 23.]
====================================================================================================================
FLAG_MOBIL: 2
FLAG_MOBIL: [1 0]
====================================================================================================================
FLAG_EMP_PHONE: 2
FLAG_EMP_PHONE: [1 0]
====================================================================================================================
FLAG_WORK_PHONE: 2
FLAG_WORK_PHONE: [0 1]
====================================================================================================================
FLAG_CONT_MOBILE: 2
FLAG_CONT_MOBILE: [1 0]
====================================================================================================================
FLAG_PHONE: 2
FLAG_PHONE: [1 0]
====================================================================================================================
FLAG_EMAIL: 2
FLAG_EMAIL: [0 1]
====================================================================================================================
OCCUPATION_TYPE: 18
OCCUPATION_TYPE: ['Laborers' 'Core staff' 'Accountants' 'Managers' nan]
====================================================================================================================
CNT_FAM_MEMBERS: 17
CNT_FAM_MEMBERS: [1. 2. 3. 4. 5.]
====================================================================================================================
REGION_RATING_CLIENT: 3
REGION_RATING_CLIENT: [2 1 3]
====================================================================================================================
REGION_RATING_CLIENT_W_CITY: 3
REGION_RATING_CLIENT_W_CITY: [2 1 3]
====================================================================================================================
WEEKDAY_APPR_PROCESS_START: 7
WEEKDAY_APPR_PROCESS_START: ['WEDNESDAY' 'MONDAY' 'THURSDAY' 'SUNDAY' 'SATURDAY']
====================================================================================================================
HOUR_APPR_PROCESS_START: 24
HOUR_APPR_PROCESS_START: [10 11  9 17 16]
====================================================================================================================
REG_REGION_NOT_LIVE_REGION: 2
REG_REGION_NOT_LIVE_REGION: [0 1]
====================================================================================================================
REG_REGION_NOT_WORK_REGION: 2
REG_REGION_NOT_WORK_REGION: [0 1]
====================================================================================================================
LIVE_REGION_NOT_WORK_REGION: 2
LIVE_REGION_NOT_WORK_REGION: [0 1]
====================================================================================================================
REG_CITY_NOT_LIVE_CITY: 2
REG_CITY_NOT_LIVE_CITY: [0 1]
====================================================================================================================
REG_CITY_NOT_WORK_CITY: 2
REG_CITY_NOT_WORK_CITY: [0 1]
====================================================================================================================
LIVE_CITY_NOT_WORK_CITY: 2
LIVE_CITY_NOT_WORK_CITY: [0 1]
====================================================================================================================
ORGANIZATION_TYPE: 58
ORGANIZATION_TYPE: ['Business Entity Type 3' 'School' 'Government' 'Religion' 'Other']
====================================================================================================================
EXT_SOURCE_1: 114584
EXT_SOURCE_1: [0.08303697 0.31126731        nan 0.77476141 0.58733405]
====================================================================================================================
EXT_SOURCE_2: 119831
EXT_SOURCE_2: [0.26294859 0.62224578 0.55591208 0.65044169 0.32273829]
====================================================================================================================
EXT_SOURCE_3: 814
EXT_SOURCE_3: [0.13937578        nan 0.72956669 0.62122634 0.49206009]
====================================================================================================================
APARTMENTS_AVG: 2339
APARTMENTS_AVG: [0.0247 0.0959    nan 0.0825 0.1474]
====================================================================================================================
BASEMENTAREA_AVG: 3780
BASEMENTAREA_AVG: [0.0369 0.0529    nan 0.0973 0.1335]
====================================================================================================================
YEARS_BEGINEXPLUATATION_AVG: 285
YEARS_BEGINEXPLUATATION_AVG: [0.9722 0.9851    nan 0.9811 0.9806]
====================================================================================================================
YEARS_BUILD_AVG: 149
YEARS_BUILD_AVG: [0.6192 0.796     nan 0.7348 0.9796]
====================================================================================================================
COMMONAREA_AVG: 3181
COMMONAREA_AVG: [0.0143 0.0605    nan 0.0582 0.1143]
====================================================================================================================

ELEVATORS_AVG: 257
ELEVATORS_AVG: [0.   0.08  nan 0.16 0.4 ]
====================================================================================================================
ENTRANCES_AVG: 285
ENTRANCES_AVG: [0.069  0.0345    nan 0.2069 0.1379]
====================================================================================================================
FLOORSMAX_AVG: 403
FLOORSMAX_AVG: [0.0833 0.2917    nan 0.1667 0.3333]
====================================================================================================================
FLOORSMIN_AVG: 305
FLOORSMIN_AVG: [0.125  0.3333    nan 0.375  0.7083]
====================================================================================================================
LANDAREA_AVG: 3527
LANDAREA_AVG: [0.0369 0.013     nan 0.0135 0.0931]
====================================================================================================================
LIVINGAPARTMENTS_AVG: 1868
LIVINGAPARTMENTS_AVG: [0.0202 0.0773    nan 0.1202 0.2849]
====================================================================================================================
LIVINGAREA_AVG: 5199
LIVINGAREA_AVG: [0.019  0.0549    nan 0.0778 0.1397]
====================================================================================================================
NONLIVINGAPARTMENTS_AVG: 386
NONLIVINGAPARTMENTS_AVG: [0.     0.0039    nan 0.0193 0.0077]
====================================================================================================================
NONLIVINGAREA_AVG: 3290
NONLIVINGAREA_AVG: [0.     0.0098    nan 0.1001 0.0044]
====================================================================================================================
APARTMENTS_MODE: 760
APARTMENTS_MODE: [0.0252 0.0924    nan 0.084  0.1502]
====================================================================================================================
BASEMENTAREA_MODE: 3841
BASEMENTAREA_MODE: [0.0383 0.0538    nan 0.101  0.1386]
====================================================================================================================
YEARS_BEGINEXPLUATATION_MODE: 221
YEARS_BEGINEXPLUATATION_MODE: [0.9722 0.9851    nan 0.9811 0.9806]
====================================================================================================================
YEARS_BUILD_MODE: 154
YEARS_BUILD_MODE: [0.6341 0.804     nan 0.7452 0.9804]
====================================================================================================================
COMMONAREA_MODE: 3128
COMMONAREA_MODE: [0.0144 0.0497    nan 0.0587 0.1153]
====================================================================================================================
ELEVATORS_MODE: 26
ELEVATORS_MODE: [0.     0.0806    nan 0.1611 0.4028]
====================================================================================================================
ENTRANCES_MODE: 30
ENTRANCES_MODE: [0.069  0.0345    nan 0.2069 0.1379]
====================================================================================================================
FLOORSMAX_MODE: 25
FLOORSMAX_MODE: [0.0833 0.2917    nan 0.1667 0.3333]
====================================================================================================================
FLOORSMIN_MODE: 25
FLOORSMIN_MODE: [0.125  0.3333    nan 0.375  0.7083]
====================================================================================================================
LANDAREA_MODE: 3563
LANDAREA_MODE: [0.0377 0.0128    nan 0.0138 0.0952]
====================================================================================================================
LIVINGAPARTMENTS_MODE: 736
LIVINGAPARTMENTS_MODE: [0.022  0.079     nan 0.1313 0.3113]
====================================================================================================================
LIVINGAREA_MODE: 5301
LIVINGAREA_MODE: [0.0198 0.0554    nan 0.081  0.1456]
====================================================================================================================
NONLIVINGAPARTMENTS_MODE: 167
NONLIVINGAPARTMENTS_MODE: [0.        nan 0.0195 0.0078 0.0039]
====================================================================================================================
NONLIVINGAREA_MODE: 3327
NONLIVINGAREA_MODE: [0.        nan 0.106  0.0047 0.0045]
====================================================================================================================
APARTMENTS_MEDI: 1148
APARTMENTS_MEDI: [0.025  0.0968    nan 0.0833 0.1489]
====================================================================================================================
BASEMENTAREA_MEDI: 3772
BASEMENTAREA_MEDI: [0.0369 0.0529    nan 0.0973 0.1335]
====================================================================================================================
YEARS_BEGINEXPLUATATION_MEDI: 245
YEARS_BEGINEXPLUATATION_MEDI: [0.9722 0.9851    nan 0.9811 0.9806]
====================================================================================================================
YEARS_BUILD_MEDI: 151
YEARS_BUILD_MEDI: [0.6243 0.7987    nan 0.7383 0.9799]
====================================================================================================================
COMMONAREA_MEDI: 3202
COMMONAREA_MEDI: [0.0144 0.0608    nan 0.0585 0.115 ]
====================================================================================================================
ELEVATORS_MEDI: 46
ELEVATORS_MEDI: [0.   0.08  nan 0.16 0.4 ]
====================================================================================================================
ENTRANCES_MEDI: 46
ENTRANCES_MEDI: [0.069  0.0345    nan 0.2069 0.1379]
====================================================================================================================
FLOORSMAX_MEDI: 49
FLOORSMAX_MEDI: [0.0833 0.2917    nan 0.1667 0.3333]
====================================================================================================================
FLOORSMIN_MEDI: 47
FLOORSMIN_MEDI: [0.125  0.3333    nan 0.375  0.7083]
====================================================================================================================
LANDAREA_MEDI: 3560
LANDAREA_MEDI: [0.0375 0.0132    nan 0.0137 0.0947]
====================================================================================================================
LIVINGAPARTMENTS_MEDI: 1097
LIVINGAPARTMENTS_MEDI: [0.0205 0.0787    nan 0.1223 0.2899]
====================================================================================================================
LIVINGAREA_MEDI: 5281
LIVINGAREA_MEDI: [0.0193 0.0558    nan 0.0792 0.1422]
====================================================================================================================
NONLIVINGAPARTMENTS_MEDI: 214
NONLIVINGAPARTMENTS_MEDI: [0.     0.0039    nan 0.0194 0.0078]
====================================================================================================================
NONLIVINGAREA_MEDI: 3323
NONLIVINGAREA_MEDI: [0.     0.01      nan 0.1022 0.0045]
====================================================================================================================
FONDKAPREMONT_MODE: 4
FONDKAPREMONT_MODE: ['reg oper account' nan 'org spec account' 'reg oper spec account'
 'not specified']
====================================================================================================================
HOUSETYPE_MODE: 3
HOUSETYPE_MODE: ['block of flats' nan 'terraced house' 'specific housing']
====================================================================================================================
TOTALAREA_MODE: 5116
TOTALAREA_MODE: [0.0149 0.0714    nan 0.0612 0.1417]
====================================================================================================================
WALLSMATERIAL_MODE: 7
WALLSMATERIAL_MODE: ['Stone, brick' 'Block' nan 'Panel' 'Mixed']
====================================================================================================================
EMERGENCYSTATE_MODE: 2
EMERGENCYSTATE_MODE: ['No' nan 'Yes']
====================================================================================================================
OBS_30_CNT_SOCIAL_CIRCLE: 33
OBS_30_CNT_SOCIAL_CIRCLE: [2. 1. 0. 4. 8.]
====================================================================================================================
DEF_30_CNT_SOCIAL_CIRCLE: 10
DEF_30_CNT_SOCIAL_CIRCLE: [ 2.  0.  1. nan  3.]
====================================================================================================================
OBS_60_CNT_SOCIAL_CIRCLE: 33
OBS_60_CNT_SOCIAL_CIRCLE: [2. 1. 0. 4. 8.]
====================================================================================================================
DEF_60_CNT_SOCIAL_CIRCLE: 9
DEF_60_CNT_SOCIAL_CIRCLE: [ 2.  0.  1. nan  3.]
====================================================================================================================
DAYS_LAST_PHONE_CHANGE: 3773
DAYS_LAST_PHONE_CHANGE: [-1134.  -828.  -815.  -617. -1106.]
====================================================================================================================
FLAG_DOCUMENT_2: 2
FLAG_DOCUMENT_2: [0 1]
====================================================================================================================
FLAG_DOCUMENT_3: 2
FLAG_DOCUMENT_3: [1 0]
====================================================================================================================
FLAG_DOCUMENT_4: 2
FLAG_DOCUMENT_4: [0 1]
====================================================================================================================
FLAG_DOCUMENT_5: 2
FLAG_DOCUMENT_5: [0 1]
====================================================================================================================
FLAG_DOCUMENT_6: 2
FLAG_DOCUMENT_6: [0 1]
====================================================================================================================
FLAG_DOCUMENT_7: 2
FLAG_DOCUMENT_7: [0 1]
====================================================================================================================
FLAG_DOCUMENT_8: 2
FLAG_DOCUMENT_8: [0 1]
====================================================================================================================
FLAG_DOCUMENT_9: 2
FLAG_DOCUMENT_9: [0 1]
====================================================================================================================
FLAG_DOCUMENT_10: 2
FLAG_DOCUMENT_10: [0 1]
====================================================================================================================
FLAG_DOCUMENT_11: 2
FLAG_DOCUMENT_11: [0 1]
====================================================================================================================

FLAG_DOCUMENT_12: 2
FLAG_DOCUMENT_12: [0 1]
====================================================================================================================
FLAG_DOCUMENT_13: 2
FLAG_DOCUMENT_13: [0 1]
====================================================================================================================
FLAG_DOCUMENT_14: 2
FLAG_DOCUMENT_14: [0 1]
====================================================================================================================
FLAG_DOCUMENT_15: 2
FLAG_DOCUMENT_15: [0 1]
====================================================================================================================
FLAG_DOCUMENT_16: 2
FLAG_DOCUMENT_16: [0 1]
====================================================================================================================
FLAG_DOCUMENT_17: 2
FLAG_DOCUMENT_17: [0 1]
====================================================================================================================
FLAG_DOCUMENT_18: 2
FLAG_DOCUMENT_18: [0 1]
====================================================================================================================
FLAG_DOCUMENT_19: 2
FLAG_DOCUMENT_19: [0 1]
====================================================================================================================
FLAG_DOCUMENT_20: 2
FLAG_DOCUMENT_20: [0 1]
====================================================================================================================
FLAG_DOCUMENT_21: 2
FLAG_DOCUMENT_21: [0 1]
====================================================================================================================
AMT_REQ_CREDIT_BUREAU_HOUR: 5
AMT_REQ_CREDIT_BUREAU_HOUR: [ 0. nan  1.  2.  3.]
====================================================================================================================
AMT_REQ_CREDIT_BUREAU_DAY: 9
AMT_REQ_CREDIT_BUREAU_DAY: [ 0. nan  1.  3.  2.]
====================================================================================================================
AMT_REQ_CREDIT_BUREAU_WEEK: 9
AMT_REQ_CREDIT_BUREAU_WEEK: [ 0. nan  1.  3.  2.]
====================================================================================================================
AMT_REQ_CREDIT_BUREAU_MON: 24
AMT_REQ_CREDIT_BUREAU_MON: [ 0. nan  1.  2.  6.]
====================================================================================================================
AMT_REQ_CREDIT_BUREAU_QRT: 11
AMT_REQ_CREDIT_BUREAU_QRT: [ 0. nan  1.  2.  4.]
====================================================================================================================
AMT_REQ_CREDIT_BUREAU_YEAR: 25
AMT_REQ_CREDIT_BUREAU_YEAR: [ 1.  0. nan  2.  4.]
====================================================================================================================

### binary features

In [12]:
binary_columns = df_application_train.columns[df_application_train.nunique() == 2].tolist()

In [13]:
binary_columns

['TARGET',
 'NAME_CONTRACT_TYPE',
 'FLAG_OWN_CAR',
 'FLAG_OWN_REALTY',
 'FLAG_MOBIL',
 'FLAG_EMP_PHONE',
 'FLAG_WORK_PHONE',
 'FLAG_CONT_MOBILE',
 'FLAG_PHONE',
 'FLAG_EMAIL',
 'REG_REGION_NOT_LIVE_REGION',
 'REG_REGION_NOT_WORK_REGION',
 'LIVE_REGION_NOT_WORK_REGION',
 'REG_CITY_NOT_LIVE_CITY',
 'REG_CITY_NOT_WORK_CITY',
 'LIVE_CITY_NOT_WORK_CITY',
 'EMERGENCYSTATE_MODE',
 'FLAG_DOCUMENT_2',
 'FLAG_DOCUMENT_3',
 'FLAG_DOCUMENT_4',
 'FLAG_DOCUMENT_5',
 'FLAG_DOCUMENT_6',
 'FLAG_DOCUMENT_7',
 'FLAG_DOCUMENT_8',
 'FLAG_DOCUMENT_9',
 'FLAG_DOCUMENT_10',
 'FLAG_DOCUMENT_11',
 'FLAG_DOCUMENT_12',
 'FLAG_DOCUMENT_13',
 'FLAG_DOCUMENT_14',
 'FLAG_DOCUMENT_15',
 'FLAG_DOCUMENT_16',
 'FLAG_DOCUMENT_17',
 'FLAG_DOCUMENT_18',
 'FLAG_DOCUMENT_19',
 'FLAG_DOCUMENT_20',
 'FLAG_DOCUMENT_21']

In [14]:
print(f"number of binary features: {len(binary_columns)}")

number of binary features: 37

### contingency matrix

In [15]:
# chi-square test of independence of variables in a contingency matrix
for column in binary_columns:
    
    target_crosstab = pd.crosstab(
        index=df_application_train[column],
        columns=df_application_train['TARGET'],
        margins=True,
    )
    display(target_crosstab)
    
    _, p_value, _, _ = chi2_contingency(target_crosstab)
    print(f"p-value: {p_value}\n")

TARGET       0      1     All
TARGET
0       282686      0  282686
1            0  24825   24825
All     282686  24825  307511

p-value: 0.0

TARGET                   0      1     All
NAME_CONTRACT_TYPE
Cash loans          255011  23221  278232
Revolving loans      27675   1604   29279
All                 282686  24825  307511

p-value: 2.6845456940854183e-62

TARGET             0      1     All
FLAG_OWN_CAR
N             185675  17249  202924
Y              97011   7576  104587
All           282686  24825  307511

p-value: 9.748590738786988e-31

TARGET                0      1     All
FLAG_OWN_REALTY
N                 86357   7842   94199
Y                196329  16983  213312
All              282686  24825  307511

p-value: 0.02037128923282243

TARGET           0      1     All
FLAG_MOBIL
0                1      0       1
1           282685  24825  307510
All         282686  24825  307511

p-value: 0.99906374744738

TARGET               0      1     All
FLAG_EMP_PHONE
0                52395   2991   55386
1               230291  21834  252125
All             282686  24825  307511

p-value: 2.119842327116858e-139

TARGET                0      1     All
FLAG_WORK_PHONE
0                227282  18921  246203
1                 55404   5904   61308
All              282686  24825  307511

p-value: 5.888114280759174e-53

TARGET                 0      1     All
FLAG_CONT_MOBILE
0                    529     45     574
1                 282157  24780  306937
All               282686  24825  307511

p-value: 0.9997812539105887

TARGET           0      1     All
FLAG_PHONE
0           202336  18744  221080
1            80350   6081   86431
All         282686  24825  307511

p-value: 1.262133206787528e-36

TARGET           0      1     All
FLAG_EMAIL
0           266618  23451  290069
1            16068   1374   17442
All         282686  24825  307511

p-value: 0.9171627113035286

TARGET                           0      1     All
REG_REGION_NOT_LIVE_REGION
0                           278462  24392  302854
1                             4224    433    4657
All                         282686  24825  307511

p-value: 0.04851136161171001

TARGET                           0      1     All
REG_REGION_NOT_WORK_REGION
0                           268462  23437  291899
1                            14224   1388   15612
All                         282686  24825  307511

p-value: 0.0050917734853862286

TARGET                            0      1     All
LIVE_REGION_NOT_WORK_REGION
0                            271239  23769  295008
1                             11447   1056   12503
All                          282686  24825  307511

p-value: 0.6545922180328126

TARGET                       0      1     All
REG_CITY_NOT_LIVE_CITY
0                       261586  21886  283472
1                        21100   2939   24039
All                     282686  24825  307511

p-value: 7.455408611968837e-130

TARGET                       0      1     All
REG_CITY_NOT_WORK_CITY
0                       219339  17305  236644
1                        63347   7520   70867
All                     282686  24825  307511

p-value: 9.087791669062205e-172

TARGET                        0      1     All
LIVE_CITY_NOT_WORK_CITY
0                        232974  19322  252296
1                         49712   5503   55215
All                      282686  24825  307511

p-value: 4.007303274167387e-69

TARGET                    0      1     All
EMERGENCYSTATE_MODE
No                   148324  11104  159428
Yes                    2105    223    2328
All                  150429  11327  161756

p-value: 7.705359894297366e-05

TARGET                0      1     All
FLAG_DOCUMENT_2
0                282677  24821  307498
1                     9      4      13
All              282686  24825  307511

p-value: 0.060501164963493136

TARGET                0      1     All
FLAG_DOCUMENT_3
0                 83658   5513   89171
1                199028  19312  218340
All              282686  24825  307511

p-value: 1.452251791868989e-129

TARGET                0      1     All
FLAG_DOCUMENT_4
0                282661  24825  307486
1                    25      0      25
All              282686  24825  307511

p-value: 0.6998283755865763

TARGET                0      1     All
FLAG_DOCUMENT_5
0                278410  24453  302863
1                  4276    372    4648
All              282686  24825  307511

p-value: 0.9998836625809906

TARGET                0      1     All
FLAG_DOCUMENT_6
0                257115  23318  280433
1                 25571   1507   27078
All              282686  24825  307511

p-value: 2.995096723773805e-53

TARGET                0      1     All
FLAG_DOCUMENT_7
0                282630  24822  307452
1                    56      3      59
All              282686  24825  307511

p-value: 0.9500888919653433

TARGET                0      1     All
FLAG_DOCUMENT_8
0                259498  22989  282487
1                 23188   1836   25024
All              282686  24825  307511

p-value: 0.0005274108654631586

TARGET                0      1     All
FLAG_DOCUMENT_9
0                281562  24751  306313
1                  1124     74    1198
All              282686  24825  307511

p-value: 0.21257860163581757

TARGET                 0      1     All
FLAG_DOCUMENT_10
0                 282679  24825  307504
1                      7      0       7
All               282686  24825  307511

p-value: 0.9614115123984657

TARGET                 0      1     All
FLAG_DOCUMENT_11
0                 281558  24750  306308
1                   1128     75    1203
All               282686  24825  307511

p-value: 0.2396792229371515

TARGET                 0      1     All
FLAG_DOCUMENT_12
0                 282684  24825  307509
1                      2      0       2
All               282686  24825  307511

p-value: 0.9963624179203493

TARGET                 0      1     All
FLAG_DOCUMENT_13
0                 281632  24795  306427
1                   1054     30    1084
All               282686  24825  307511

p-value: 2.375493460034972e-08

TARGET                 0      1     All
FLAG_DOCUMENT_14
0                 281813  24795  306608
1                    873     30     903
All               282686  24825  307511

p-value: 1.544409215710728e-05

TARGET                 0      1     All
FLAG_DOCUMENT_15
0                 282325  24814  307139
1                    361     11     372
All               282686  24825  307511

p-value: 0.010633377018992666

TARGET                 0      1     All
FLAG_DOCUMENT_16
0                 279783  24675  304458
1                   2903    150    3053
All               282686  24825  307511

p-value: 2.1344406270156996e-08

TARGET                 0      1     All
FLAG_DOCUMENT_17
0                 282606  24823  307429
1                     80      2      82
All               282686  24825  307511

p-value: 0.4766512379093101

TARGET                 0      1     All
FLAG_DOCUMENT_18
0                 280328  24683  305011
1                   2358    142    2500
All               282686  24825  307511

p-value: 0.0006418729273121938

TARGET                 0      1     All
FLAG_DOCUMENT_19
0                 282515  24813  307328
1                    171     12     183
All               282686  24825  307511

p-value: 0.9666913795720936

TARGET                 0      1     All
FLAG_DOCUMENT_20
0                 282543  24812  307355
1                    143     13     156
All               282686  24825  307511

p-value: 0.9999746780322938

TARGET                 0      1     All
FLAG_DOCUMENT_21
0                 282597  24811  307408
1                     89     14     103
All               282686  24825  307511

p-value: 0.37583962179951236

#### gender

In [16]:
Counter(df_application_train['CODE_GENDER'])

Counter({'M': 105059, 'F': 202448, 'XNA': 4})

In [17]:
# filter XNA
gender_filter = (df_application_train['CODE_GENDER'] != 'XNA')

In [18]:
target_crosstab = pd.crosstab(
    index=df_application_train['CODE_GENDER'][gender_filter],
    columns=df_application_train['TARGET'][gender_filter],
    margins=True,
)
target_crosstab

TARGET            0      1     All
CODE_GENDER
F            188278  14170  202448
M             94404  10655  105059
All          282682  24825  307507

In [19]:
_, p_value, _, _ = chi2_contingency(target_crosstab)
print(f"p-value: {p_value}\n")

p-value: 6.241024167295911e-198